scc2425-tukano/src/main/test/artillery/shorts/post_follow.yaml
config:
  target: http://127.0.0.1:8080/rest
  plugins:
    metrics-by-endpoint: { }
  phases:
    - name: post_follow
      duration: 3
      arrivalCount: 1
      scenario: TuKanoPostFollow
scenarios:
  - name: TuKanoPostFollow
    flow:
      - post:
          url: "/shorts/user1/user2/followers?pwd=pass1" #assuming user1 and user2 in db
          headers:
            Content-Type: application/json
          json:
            true