scc2425-tukano/src/main/test/artillery/shorts/post_short.yaml
config:
  target: http://127.0.0.1:8080/rest
  plugins:
    metrics-by-endpoint: { }
  phases:
    - name: post_short
      duration: 3
      arrivalCount: 1
      scenario: TuKanoPostShort
  processor: ./test-utils.js
scenarios:
  - name: TuKanoPostShort
    flow:
      - post:
          url: "/shorts/user1?pwd=pass1" #Assuming user1 with pass1 in db
          headers:
            Content-Type: application/json